#### **IN operator**
The **IN** operator is used in a WHERE clause to determine if a value matches one of several values. The SELECT statement in the figure below uses the IN operator to select only rows where the Language column has a Dutch, Kongo, or Albanian value.

    SELECT * 
    FROM CountryLanguage 
    WHERE Language IN ('Dutch', 'Kongo', 'Albanian');

---

#### **LIKE operator**
The **LIKE** operator, when used in a WHERE clause, matches text against a pattern using the two wildcard characters % and _.

- % matches any number of characters. Ex: LIKE 'L%t' matches "Lt", "Lot", "Lift", and "Lol cat".
- _ matches exactly one character. Ex: LIKE 'L_t' matches "Lot" and "Lit" but not "Lt" and "Loot".
The LIKE operator performs case-insensitive pattern matching by default or case-sensitive pattern matching if followed by the BINARY keyword. Ex: LIKE **BINARY** 'L%t' matches 'Left' but not 'left'.

To search for the wildcard characters % or _, a backslash (\) must precede % or _. Ex: LIKE 'a\%' matches "a%".

PARTICIPATION ACTIVITY
3.3.2: Using the LIKE operator.

The given SQL creates a Movie table and inserts some movies. 

The SELECT statement selects movies with the word "star" somewhere in the title.

In [1]:
%load_ext sql

In [7]:
%%sql sqlite://

CREATE TABLE Movies (
  ID INT AUTO_INCREMENT,
  Title VARCHAR(100),
  Rating CHAR(5) CHECK (Rating IN ('G', 'PG', 'PG-13', 'R')),
  ReleaseDate DATE,
  PRIMARY KEY (ID)
);

INSERT INTO Movies (Title, Rating, ReleaseDate) VALUES
  ('Rogue One: A Star Wars Story', 'PG-13', '2016-12-16'),
  ('Star Trek', 'PG-13', '2009-05-08'),
  ('The Dark Knight', 'PG-13', '2008-07-18'),
  ('Stargate', 'PG-13', '1994-10-28'),
  ('Avengers: Endgame', 'PG-13', '2019-04-26');

-- Modify the SELECT statement:
SELECT Title
FROM Movies
WHERE Title LIKE '%star%';

Done.
5 rows affected.
Done.

[('Rogue One: A Star Wars Story',), ('Star Trek',), ('Stargate',)]

---

#### **DISTINCT clause**
The ***DISTINCT*** clause is used with a SELECT statement to return only unique values. Ex: The first SELECT statement in the figure below results in two 'Spanish' rows, but the second SELECT statement returns only unique languages, resulting in only one 'Spanish' row.

    SELECT Language
    FROM CountryLanguage
    WHERE IsOfficial = 'F';
 
Spanish

Balochi

Spanish

    SELECT DISTINCT Language
    FROM CountryLanguage
    WHERE IsOfficial = 'F';
 
Spanish

Balochi

---

#### **ORDER BY clause**
A SELECT statement selects rows from a table with no guarantee the data will come back in a certain order. The ***ORDER BY*** clause orders selected rows by one or more columns in ascending (alphabetic or increasing) order. The ***DESC*** keyword with the ORDER BY clause orders rows in descending order.

    -- Order by Language (ascending)
    SELECT * 
    FROM CountryLanguage 
    ORDER BY Language;
 
GAB   Fang   F   35.8   

GAB   Mbete  F   13.8  

FSM   Woleai  F    3.7  

FSM   Yap    F    5.8

    -- Order by Language (descending)
    SELECT * 
    FROM CountryLanguage 
    ORDER BY Language DESC;
 
FSM   Yap    F    5.8

FSM   Woleai  F    3.7

GAB   Mbete  F   13.8 

GAB   Fang   F   35.8

    -- Order by CountryCode, then Language
    SELECT * 
    FROM CountryLanguage 
    ORDER BY CountryCode, Language;
 
FSM   Woleai  F    3.7

FSM   Yap    F    5.8

GAB   Fang   F    35.8

GAB   Mbete  F    13.8

---

#### **Limiting clauses**
Queries against very large tables might return thousands or millions of rows. Databases support special clauses that limit the number of rows returned by a query. The syntax of limiting clauses is not standardized.

MySQL supports a ***LIMIT*** clause, consisting of the LIMIT keyword and number of rows. The LIMIT clause appears at the end of the SELECT statement.

**MySQL example**

    SELECT *
    FROM CountryLanguage
    LIMIT 20;

SQL Server supports a ***TOP*** clause, consisting of the TOP keyword and number of rows. The TOP clause follows the SELECT keyword.

**SQL Server example**    

    SELECT TOP 20 *
    FROM CountryLanguage;

Oracle Database supports a ***FETCH*** clause, with syntax FETCH FIRST number ROWS ONLY. The FETCH clause appears at the end of the SELECT statement.

**Oracle Database example**

    SELECT *
    FROM CountryLanguage
    FETCH FIRST 20 ROWS ONLY;

When a limit clause is used without an ORDER BY clause, the rows that appear are unpredictable. When a limit clause is used with ORDER BY, the rows that appear are based on row order and predictable. For this reason, LIMIT, TOP, and FETCH clauses are usually used with an ORDER BY clause.